#pragma once

#define def_ARRAY_SIZE 20

//==============================================
// 배열 출력하는 함수
//==============================================
void ArrayPrint(int Array[], int iClosePos1, int iClosePos2);

//==============================================
// 배열의 위치 두개를 받아서 교환
//==============================================
void Swap(int Array[], int iPos1, int iPos2);

//==============================================
// 버블소트 함수
//==============================================
void BubbleSort(int Array[], int iSize);