#pragma once

//==============================================
// 배열 출력하는 함수
//==============================================
void ArrayPrint(int Array[], int iClosePos1, int iClosePos2, bool bLine);

//==============================================
// 배열의 위치 두개를 받아서 교환
//==============================================
void Swap(int Array[], int iPos1, int iPos2);

//==============================================
// 퀵소트 메인 함수, 재귀함수
//==============================================
void QuickSort(int Array[], int iLeft, int iRight);