#pragma once
//===================================================================
// 사용 예
//===================================================================
// int iValue1, iValue2;
// Parser_LoadFile("Config.ini");
// Parser_GetValue_Int("Version", &iValue1);
// Parser_GetValue_Int("ServerID", &iValue2);
//===================================================================

typedef struct _Data
{
	int	m_iVersion;
	int m_iServerID;
	char m_chServerBindIP[50];
	int m_iServerBindPort;
	int m_iWorkerThread;
	int m_iMaxUser;
}Data;

//===================================================================
// 파일 로드
//===================================================================
bool Parser_LoadFile(const char* chFileName);

//===================================================================
// 스페이스, 탭, 엔터코드, 주석 처리
// GetNextWord에서 단어 스킵 여부 체크 ture: 스킵o
//===================================================================
bool SkipNoneCommand(char chpTempBuffer);

//===================================================================
// 다음 단어 찾기
//===================================================================
bool GetNextWord(char* chppBuffer, int* ipLength);

//===================================================================
// 실제 항목의 데이터를 얻어오는 함수(찾고자 하는 항목 이름/ 데이터를 넣을 INT 포인터)
//===================================================================
bool Parser_GetValue_Int(const char* szName, int* ipValue);

//===================================================================
// 문자열 얻기
//===================================================================
bool Parser_GetValue_String(const char* chppBuffer, char* value);

//===================================================================
// Data 구조체 print
//===================================================================
void PrintData(Data data);