#pragma once

//=========================================================
// 패킹파일 헤더
// Type		4byte	: 0x99886655
// FileNum	4byte	: 내부 파일 개수
//=========================================================
// 내부 파일 이름 및 사이즈(FileNum만큼 반복)
// Size		4byte	: 파일 사이즈
// char		128byte	: 파일 이름
//=========================================================
// 파일 데이터 FileNum * Size
//=========================================================

//=========================================================
// 패킹 파일 가장 앞 헤더
//=========================================================
typedef struct st_PACK_HEADER_
{
	unsigned int	iType;		// 0x99886655이 들어감
	int				iFileNum;
}stPACK_HEADER;

//=========================================================
// 내부 파일 정보
//=========================================================
typedef struct st_PACK_FILEINFO_
{
	int		iFileSize;
	char	szFileName[128];
}stPACK_FILEINFO;

//=========================================================
// 실제 파일 패킹 처리 작업
//=========================================================
void FilePacking(char* szPackingFile, int iElementFileNum, char** szElementNameArray);

//=========================================================
// 실제 파일 분리 작업
//=========================================================
void FileUnpacking(char* szFile);

//=========================================================
// 파일 패킹/언패킹모드
//=========================================================
void ModePacking();
void ModeUnpacking();